In [10]:
# importing pandas module
import pandas as pd 
 
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 

# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['a', 'b', 'c', 'd'])

df1=df.reindex(['b','c','d','a'])

In [4]:
df1

     Name  Age    Address Qualification  Mobile No
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76
a     Jai   27     Nagpur           Msc         97

In [5]:
for i in df1.iterrows():
    print(i)

('b', Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object)
('c', Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object)
('d', Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object)
('a', Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object)

In [6]:
for i,j in df1.iterrows():
    print(i)
    print(j)

b
Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object
c
Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object
d
Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object
a
Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object

In [7]:
for i,j in df1.iterrows():
    # print(i)
    print(j)

Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Mobile No            91
Name: b, dtype: object
Name                Gaurav
Age                     22
Address          Allahabad
Qualification          MCA
Mobile No               58
Name: c, dtype: object
Name                Anuj
Age                   32
Address          Kannuaj
Qualification        Phd
Mobile No             76
Name: d, dtype: object
Name                Jai
Age                  27
Address          Nagpur
Qualification       Msc
Mobile No            97
Name: a, dtype: object

In [8]:
allData= []
for i, j in df.iterrows():
    # print(j['Name'])
    oneData = {
        'Name': j['Name'],
        'Age' : j['Age'],
        'Address' : j['Address'],
        'Qualification' : j['Qualification'],
        'Mobile No' : j['Mobile No'],
    }
    allData.append(oneData)

print(allData)

[{'Name': 'Jai', 'Age': 27, 'Address': 'Nagpur', 'Qualification': 'Msc', 'Mobile No': 97}, {'Name': 'Princi', 'Age': 24, 'Address': 'Kanpur', 'Qualification': 'MA', 'Mobile No': 91}, {'Name': 'Gaurav', 'Age': 22, 'Address': 'Allahabad', 'Qualification': 'MCA', 'Mobile No': 58}, {'Name': 'Anuj', 'Age': 32, 'Address': 'Kannuaj', 'Qualification': 'Phd', 'Mobile No': 76}]

In [13]:
for i, j in df.items():
    print(i,j)

Name a       Jai
b    Princi
c    Gaurav
d      Anuj
Name: Name, dtype: object
Age a    27
b    24
c    22
d    32
Name: Age, dtype: int64
Address a       Nagpur
b       Kanpur
c    Allahabad
d      Kannuaj
Name: Address, dtype: object
Qualification a    Msc
b     MA
c    MCA
d    Phd
Name: Qualification, dtype: object
Mobile No a    97
b    91
c    58
d    76
Name: Mobile No, dtype: int64

In [15]:
list(df["Name"])

['Jai', 'Princi', 'Gaurav', 'Anuj']

In [16]:
list(df["Age"])

[27, 24, 22, 32]

In [25]:
df.apply(lambda x:x.sum())

Name                      JaiPrinciGauravAnuj
Age                                       105
Address          NagpurKanpurAllahabadKannuaj
Qualification                     MscMAMCAPhd
Mobile No                                 322
dtype: object

In [22]:
numbers = [1, 2, 3, 4, 5]
total_sum = sum(numbers)
print("The sum of numbers is:", total_sum)

The sum of numbers is: 15

In [24]:
l= [1, 2, 3, 4, 5]
sum(l)

15

In [32]:
def test(x):
    st=""
    st=st+str(x)
    return st

df.apply(test)

Name             a       Jai\nb    Princi\nc    Gaurav\nd      ...
Age              a    27\nb    24\nc    22\nd    32\nName: Age,...
Address          a       Nagpur\nb       Kanpur\nc    Allahabad...
Qualification    a    Msc\nb     MA\nc    MCA\nd    Phd\nName: ...
Mobile No        a    97\nb    91\nc    58\nd    76\nName: Mobi...
dtype: object

In [36]:
df[["Age","Mobile No"]].apply(lambda x:x**2)

    Age  Mobile No
a   729       9409
b   576       8281
c   484       3364
d  1024       5776

In [35]:
df[["Age","Mobile No"]].applymap(lambda x:x**2)

    Age  Mobile No
a   729       9409
b   576       8281
c   484       3364
d  1024       5776

In [37]:
df

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [38]:
df.sort_values("Name")

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91

In [39]:
df.sort_index()

     Name  Age    Address Qualification  Mobile No
a     Jai   27     Nagpur           Msc         97
b  Princi   24     Kanpur            MA         91
c  Gaurav   22  Allahabad           MCA         58
d    Anuj   32    Kannuaj           Phd         76

In [41]:
df.sort_index( ascending=False)

     Name  Age    Address Qualification  Mobile No
d    Anuj   32    Kannuaj           Phd         76
c  Gaurav   22  Allahabad           MCA         58
b  Princi   24     Kanpur            MA         91
a     Jai   27     Nagpur           Msc         97

In [45]:
pd.set_option("display.max_colwidth",1000)
p = pd.DataFrame({"a":["Reading is an essential activity that opens the doors to a world of knowledge and imagination. It is a gateway to learning about different cultures, historical events, scientific discoveries, and various perspectives. Through reading, we can explore the minds of great thinkers, travel to far-off places, and experience emotions beyond our own. Reading helps to expand our vocabulary, improve our critical thinking skills, and enhance our ability to express ourselves effectively. Moreover, it has a profound impact on cognitive development, as it stimulates the brain and encourages active engagement with ideas. Whether it's fiction, non-fiction, poetry, or academic material, reading broadens our horizons and fosters a lifelong love for learning. In the digital age, where information is abundant, the skill of discerning reliable sources becomes crucial, and reading equips us with this discernment. By cultivating a reading habit, we nourish our minds, nurture empathy, and become more informed and well-rounded individuals, contributing positively to our personal growth and the society at large."],
                  "b":["asd fghk jhg nb fvd s adfgh"],
                  "c":"tyujk llkjhf tyh gfcv shdfl dsiuhgiuvh sihgoija"})

In [46]:
p

,a,b,c
0,"Reading is an essential activity that opens the doors to a world of knowledge and imagination. It is a gateway to learning about different cultures, historical events, scientific discoveries, and various perspectives. Through reading, we can explore the minds of great thinkers, travel to far-off places, and experience emotions beyond our own. Reading helps to expand our vocabulary, improve our critical thinking skills, and enhance our ability to express ourselves effectively. Moreover, it has a profound impact on cognitive development, as it stimulates the brain and encourages active engagement with ideas. Whether it's fiction, non-fiction, poetry, or academic material, reading broadens our horizons and fosters a lifelong love for learning. In the digital age, where information is abundant, the skill of discerning reliable sources becomes crucial, and reading equips us with this discernment. By cultivating a reading habit, we nourish our minds, nurture empathy, and become more info...",asd fghk jhg nb fvd s adfgh,tyujk llkjhf tyh gfcv shdfl dsiuhgiuvh sihgoija

In [47]:
p["word_len"]=p["a"].apply(lambda x: len(x.split()))

In [48]:
p

,a,b,c,word_len
0,"Reading is an essential activity that opens the doors to a world of knowledge and imagination. It is a gateway to learning about different cultures, historical events, scientific discoveries, and various perspectives. Through reading, we can explore the minds of great thinkers, travel to far-off places, and experience emotions beyond our own. Reading helps to expand our vocabulary, improve our critical thinking skills, and enhance our ability to express ourselves effectively. Moreover, it has a profound impact on cognitive development, as it stimulates the brain and encourages active engagement with ideas. Whether it's fiction, non-fiction, poetry, or academic material, reading broadens our horizons and fosters a lifelong love for learning. In the digital age, where information is abundant, the skill of discerning reliable sources becomes crucial, and reading equips us with this discernment. By cultivating a reading habit, we nourish our minds, nurture empathy, and become more info...",asd fghk jhg nb fvd s adfgh,tyujk llkjhf tyh gfcv shdfl dsiuhgiuvh sihgoija,162

In [49]:
pd.set_option("display.max_colwidth", 1000)
dfLorem = pd.DataFrame({"test":["Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.", "Hi I am learning DS", "I will eventually learn AI, ML, DL"]})
dfLorem['word_ln'] = dfLorem['test'].apply(lambda x: len(x.split()))
dfLorem

,test,word_ln
0,"Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged.",60
1,Hi I am learning DS,5
2,"I will eventually learn AI, ML, DL",7